{
  "version": 1,
  "ratings": [
    {
      "id": 1,
      "text": "What is this nasty thing? Have you ever washed it? Disgusting... 1.5 / 10.",
      "score": 1.5
    },
    {
      "id": 2,
      "text": "Oh boy, I've seen this before, you got a lot of work to do kiddo... 3.5/10.",
      "score": 3.5
    },
    {
      "id": 3,
      "text": "Looks like a pretty average cock, has a lot of room for improvement. 5 / 10.",
      "score": 5
    },
    {
      "id": 4,
      "text": "Looks alright, a little on the smaller size, nice shape to it though, good angle and girth. 6.5 / 10!",
      "score": 6.5
    },
    {
      "id": 5,
      "text": "Look at that, impressive! Almost as big as mine, hair is trimmed well, but you could use a wash... 7 / 10.",
      "score": 7
    },
    {
      "id": 6,
      "text": "It's okay don't be shy, there we go, look at the size of this thing! That's impressive! A bit too veiny though... 7/10.",
      "score": 7
    },
    {
      "id": 7,
      "text": "Aren't you excited to see me? Mind if I just lift it here? You got some weight to this bad boy... 7.5/10!",
      "score": 7.5
    },
    {
      "id": 8,
      "text": "Now look at this! What an entrance that was! Ouu is this a pattern shaved in? Fancy cock there kiddo, 8 / 10!",
      "score": 8
    },
    {
      "id": 9,
      "text": "Woah - nice cock. Nice 80° angle, could trim the hairs a bit... Yep, that is a nice cock. 8.5 / 10!",
      "score": 8.5
    },
    {
      "id": 10,
      "text": "Now this is... this is a really nice cock.Perfect shape, very clean, hmmm... looks like you missed some hair... 9 / 10!",
      "score": 9
    },
    {
      "id": 11,
      "text": "Unbelievable! This is outstanding! Probably the best cock I have ever seen, all men should look up to you! 10 / 10",
      "score": 10
    },
    {
      "id": 12,
      "text": "Nice joke pal, we're rating cocks here... not snakes! Wait.. it's... oh my... 7.5 / 10!",
      "score": 7.5
    },
    {
      "id": 13,
      "text": "Alright let's take a look... Not bad, not bad at all, above average I'd say. 7 / 10!",
      "score": 7
    },
    {
      "id": 14,
      "text": "Let me take a look. Oh my. This is beautiful, truely a work of art. Billy would be proud of you 9 / 10.",
      "score": 9
    },
    {
      "id": 15,
      "text": "Ok take them off... oh! A tattoo? Property of... BLUESCHAMP ? That guy, I tell ya... 6 / 10.",
      "score": 6
    },
    {
      "id": 16,
      "text": "Hmmm... A little shy today? That's okay, it will only cost you a few points. Let's see....6.5 / 10!",
      "score": 6.5
    },
    {
      "id": 17,
      "text": "My god, what is that thing? You could knock someone out with a swing of that bad boy.I give it... 6.5 / 10.",
      "score": 6.5
    },
    {
      "id": 18,
      "text": "Ok let's have a look! Are you trying into cosplay? Because this looks like Simba with all that hair. 7/10, trim it up and come back.",
      "score": 7
    },
    {
      "id": 19,
      "text": "Look at this puppy! Ready to take off like the Apollo 13.Pretty nice cock you got there bud, 8 / 10.",
      "score": 8
    },
    {
      "id": 20,
      "text": "Interesting... interesting... you've got style to this. Something I haven't seen in a while, but you make it work so well.Nice cock bro, 8 / 10!",
      "score": 8
    },
    {
      "id": 21,
      "text": " Woah! This is a good looking cock! It's almost- wait a second... this is fake! Get out of here you cheater!",
      "score": -1
    },
    {
      "id": 22,
      "text": "This... it's so shiny... why is it so shiny? How long did you spend polishing this?! 5/10...",
      "score": 5
    },
    {
      "id": 23,
      "text": "Let's take a look! A bit girthy today aren't we? Not bad though, I would keep it shaved, looks better, 7.5 / 10.",
      "score": 7.5
    },
    {
      "id": 24,
      "text": "Look at this thing! Looks like you could break a brick in half with how much meat you got on this cock, I give it... 7 / 10!",
      "score": 7
    },
    {
      "id": 25,
      "text": "Okay we got a big one here! Almost... too big... looks like you have troubles lifting that thing when you use the washroom, not ideal at all... 6 / 10.",
      "score": 6
    },
    {
      "id": 26,
      "text": "Let's see here... Looks nice, very clean, good angle and is... it is! Lemon scented too! What a gentleman! Overall, this is a quality cock, 9/10.",
      "score": 9
    },
    {
      "id": 27,
      "text": "Well, well... look who came crawling back for another evaluation. Drop'em. Oh nice, you've cleaned up nice.Good hair trim, adjusted your angle... 9 / 10, nice cock bro.",
      "score": 9
    },
    {
      "id": 28,
      "text": "Look at this! Good girth, pretty nice curve, and the tip - to - shaft ratio is perfect, I'd say this is almost a perfect cock, 9.5/10 well done.",
      "score": 9.5
    },
    {
      "id": 29,
      "text": "Oh hey! Look here's some water works for us... ok... that's enough... you can stop... OK I GET IT! Jeeze, gonna need a towel... 6.5 / 10, too uncontrollable.",
      "score": 6.5
    },
    {
      "id": 30,
      "text": "Woah, look at this here! Looks like you stuck a banana between a couple of oranges, now that's a nice cock! I give it... 8/10, nice job!",
      "score": 8
    },
    {
      "id": 31,
      "text": "Ok pal, this can't be real. It is...? I'm so sorry... listen, it's not how big it is, it's how you use it... I'll give you some pity points, 4/10.",
      "score": 4
    },
    {
      "id": 32,
      "text": "Oh - nice cock.A little on the small side, but you've got good symmetry and your balls have just the right amount of hair. I rate it... 7/10.",
      "score": 7
    },
    {
      "id": 33,
      "text": "Ok lets take - OH MY. Two? Never had that happen before... lets see... lefty gets 8 / 10 and righty gets 6.5 / 10, lil' guy needs some work.",
      "score": -1
    },
    {
      "id": 34,
      "text": "This is superb! Like nothing I've ever seen before! Truly a work of art from the gods! What a LEGENDARY cock. This is the mythical 11/10!",
      "score": 11
    },
    {
      "id": 35,
      "text": "This has go to be the worst thing I've ever seen! Disgreaseful, a mockery of cocks around the globe, 0/10!",
      "score": 0
    },
    {
      "id": 36,
      "text": "Look what we have here! Now this is pretty nice, the shape, the length, overall it's a nice cock! Almost better than mine... I give it, 8.5/10!",
      "score": 8.5
    },
    {
      "id": 37,
      "text": "Let's see here... is this...? A carrot? Did... did you eat a Bugsnax? I don't think I can rate this, sorry.",
      "score": -1
    },
    {
      "id": 38,
      "text": "Ugh! Don't even bother taking your pants off, I can smell it from here! No, just... no! 0/10.",
      "score": 0
    },
    {
      "id": 39,
      "text": "Look at that buldge! Hey wait a second, you're using a pant's stuffer! Well... your cock isn't half bad aside from that mishap, that will cost you, 4/10.",
      "score": 4
    },
    {
      "id": 40,
      "text": "Good lord what is that thing!I don't wanna touch it. The size is nice, the hair looks great, but those warts! Please, see a doctor! 3/10.",
      "score": 3
    },
    {
      "id": 41,
      "text": "Let's take a look here. Kinda on the limp side... is that a common problem? Listen pal, don't feel bad about it, happens to the best of us, 5 / 10.",
      "score": 5
    },
    {
      "id": 42,
      "text": "Oh! Take a look here, reminds me of my college years.A nice suit and bowtie on the tall fella, good cologne choice, this is a nice cock! 9 / 10.",
      "score": 9
    },
    {
      "id": 43,
      "text": "Hold on pal, I'm gonna need some license and registration for the size of this thing! You only have a class G license, this is class A, I'm gonna dock you some points for that, 7 / 10.",
      "score": 7
    },
    {
      "id": 44,
      "text": "Holy moly! Look at this here! HandsUp PRAISE HYDRA HandsUp 10 / 10!",
      "score": 10
    },
    {
      "id": 45,
      "text": "Alright let's see... it's better than before, but you still didn't wash it! Get that stinky thing outta here! 2/10!",
      "score": 2
    },
    {
      "id": 46,
      "text": "This is a travesty... you've death gripped this cock so much it looks like a pepperette, lay off waifu's for a bit pal, 3 / 10.",
      "score": 3
    },
    {
      "id": 47,
      "text": "Well, this isn't the first time I've seen this before... listen, there's this great doctor who can uncurl this bad boy. Once you do that, come back, 4/10 for now.",
      "score": 4
    },
    {
      "id": 48,
      "text": "Buddy listen, the amount of glitter, lipstick and... whatever the hell that is, make it look like you crashed your cock into a clown college, 2 / 10.",
      "score": 2
    },
    {
      "id": 49,
      "text": "Where is it ? I don't see it at all... let me grab my magnifying glass. Listen friend, it isn't about how big it is, it's how you use it that matters, I'll give you a generous 3.5 / 10.",
      "score": 3.5
    },
    {
      "id": 50,
      "text": "What on Earth ? Gold plated ? You're quite literally the Gold Member. Aside from that, it's a pretty nice cock bro.Good length, clean, freshly trimmed... 8 / 10.",
      "score": 8
    },
    {
      "id": 51,
      "text": "Based on your military experience, I was expecting a soldier standing at attention.Instead I got an old veteran with some dufflebags.I give it... 4.5 / 10.",
      "score": 4.5
    },
    {
      "id": 52,
      "text": "Damn, what is this monstrosity? It's like a twisted Picasso painting down there. 2/10.",
      "score": 2
    },
    {
      "id": 53,
      "text": "Oh boy, this is a work in progress, my friend. Keep at it, and maybe one day it'll be presentable. 4/10.",
      "score": 4
    },
    {
      "id": 54,
      "text": "Eh, it's a pretty average cock. Nothing special going on, but nothing too disappointing either. 5.5/10.",
      "score": 5.5
    },
    {
      "id": 55,
      "text": "Hmm, not bad. Decent size, nice symmetry, but it lacks that wow factor, keep working on your cock. 6.5 / 10.",
      "score": 6.5
    },
    {
      "id": 56,
      "text": "Okay, now we're talking! This is a solid contender. Good length, impressive girth, and a satisfying shape. Nice cock bro. 8/10!",
      "score": 8
    },
    {
      "id": 57,
      "text": "Whoa, hold up!This is a next - level cock. It's like a sculpted masterpiece. Smooth, majestic, and downright breathtaking. 9.5/10!",
      "score": 9.5
    },
    {
      "id": 58,
      "text": "Hmm, interesting choice of presentation. It's unconventional, but it somehow works. I'll give it a solid 8 / 10 for creativity, nice cock.",
      "score": 8
    },
    {
      "id": 59,
      "text": "Okay, this is unique!A bit unconventional, but it's got its own flair. 7.5/10, keep doing your thing! It's a decent cock.",
      "score": 7.5
    },
    {
      "id": 60,
      "text": "Well, well, what do we have here? It's like a hidden gem waiting to be discovered. Solid size, nice curves. 8/10, impressive cock!",
      "score": 8
    },
    {
      "id": 61,
      "text": "Well, well, what have we here? It's like a hidden treasure waiting to be discovered. A promising start, 6.5/10.",
      "score": 6.5
    },
    {
      "id": 62,
      "text": "Hmm, interesting choice of aesthetics. It's unconventional, to say the least. I'll give it points for originality, 7/10.",
      "score": 7
    },
    {
      "id": 63,
      "text": "Oh my, now this is a showstopper! It's got the perfect combination of size, shape, and confidence. A solid 8.5/10!",
      "score": 8.5
    },
    {
      "id": 64,
      "text": "Oops, seems like we've hit a rough patch. It's not quite there yet, but don't lose hope. Keep working on it, 4.5/10.",
      "score": 4.5
    },
    {
      "id": 65,
      "text": "Whoa, hold up! This is a whole new level of excellence. It's like the Michelangelo of cocks. Absolutely stunning, 9.5/10!",
      "score": 9.5
    },
    {
      "id": 66,
      "text": "Well, well, well, what do we have here? It's a grower, not a shower. Underestimate it at your own risk. 7/10, surprises await!",
      "score": 7
    },
    {
      "id": 67,
      "text": "Oh my, this is remarkable! It's as if the gods themselves sculpted this beauty. An outstanding 10/10, a true marvel!",
      "score": 10
    },
    {
      "id": 68,
      "text": "Yikes, we've hit a bit of a snag. It's not the most flattering presentation, but hey, we all have our off days. 3.5/10.",
      "score": 3.5
    },
    {
      "id": 69,
      "text": "Well, I must say, this is an intriguing specimen. It's got its own unique charm, despite its quirks. 6.5/10, keep embracing individuality!",
      "score": 6.5
    },
    {
      "id": 70,
      "text": "Hold on a minute! This is a true masterpiece in the making. The potential is undeniable. Keep refining and watch it soar. 8/10!",
      "score": 8
    },
    {
      "id": 71,
      "text": "Okay, okay, slow down there! It's like a rocket ready for takeoff. Impressive size, but handle this cock with care. 7.5/10.",
      "score": 7.5
    },
    {
      "id": 72,
      "text": "Whoa, wait a second! This is a crowd-pleaser, no doubt about it. A showstopper that demands attention. 9/10, exceptional work!",
      "score": 9
    },
    {
      "id": 73,
      "text": "Oh dear, we seem to have stumbled upon a less-than-ideal scenario. It's a bit lackluster, but don't despair. 4/10, room for improvement!",
      "score": 4
    },
    {
      "id": 74,
      "text": "Wow, just wow! This is a true masterpiece, a work of art. The perfect combination of aesthetics and functionality. 10/10, pure perfection!",
      "score": 10
    },
    {
      "id": 75,
      "text": "Ahh man what dripped on me?! It's... grease! What is this? The cock of greaseman? No, not quite... 0/10, clean it up!",
      "score": 0
    },
    {
      "id": 76,
      "text": "Well, this is underwhelming. Your cock is like a deflated balloon, lacking any excitement. 3/10, try harder.",
      "score": 3
    },
    {
      "id": 77,
      "text": "Oh no, this is just sad. It's like a wilted flower, no life left in this cock. 1.5/10, needs serious improvement.",
      "score": 1.5
    },
    {
      "id": 78,
      "text": "Oh my... It's like a shadow of a cock, barely there at all. 0/10, needs a miracle.",
      "score": 0
    },
    {
      "id": 79,
      "text": "Another grease cock? Wait a second... that shine! This is the greaseman cock of legend! Always lubed and ready to go! 10/10, Nice cock!",
      "score": 10
    },
    {
      "id": 80,
      "text": "Oh boy... We've hit rock bottom. It's a disaster of epic proportions. OMEGALUL /10, there's no coming back from this.",
      "score": -1
    },
    {
      "id": 81,
      "text": "What is this disaster? Looks like it got caught in a lawnmower. 2/10, please take care of it.",
      "score": 2
    },
    {
      "id": 82,
      "text": "Oh dear, looks like someone overinflated a balloon. This is just awkward. 3.5/10.",
      "score": 3.5
    },
    {
      "id": 83,
      "text": "Well, that's one shiny cock! Looks like it's been polished to perfection. 8/10, nice effort.",
      "score": 8
    },
    {
      "id": 84,
      "text": "Hmm, not bad, not great. It's just kind of... there. 5.5/10, could use some improvement.",
      "score": 5.5
    },
    {
      "id": 85,
      "text": "Whoa, that's a wild one! It looks like it's been on an adventure. 6.5/10, points for uniqueness.",
      "score": 6.5
    },
    {
      "id": 86,
      "text": "Is this a joke? Looks like a rubber chicken. 1/10, better luck next time.",
      "score": 1
    },
    {
      "id": 87,
      "text": "Wow, this is something else! Like a piece of modern art. 8.5/10, very impressive.",
      "score": 8.5
    },
    {
      "id": 88,
      "text": "Oh no, looks like a squashed banana. 3/10, needs some serious help.",
      "score": 3
    },
    {
      "id": 89,
      "text": "Well, this is a surprise! Looks like a sculpture from a renaissance artist. 9.5/10, almost perfect.",
      "score": 9.5
    },
    {
      "id": 90,
      "text": "What on earth? Looks like a science experiment gone wrong. 2.5/10, needs work.",
      "score": 2.5
    },
    {
      "id": 91,
      "text": "Hmm, decent, but nothing to write home about. 5/10, keep trying.",
      "score": 5
    },
    {
      "id": 92,
      "text": "Whoa, this one is a contender! Great shape and size. 8/10, nice cock bro.",
      "score": 8
    },
    {
      "id": 93,
      "text": "Oh my, this is a masterpiece! Looks like it belongs in a museum. 9.5/10, outstanding.",
      "score": 9.5
    },
    {
      "id": 94,
      "text": "Uh oh, looks like someone has been neglecting this. 3/10, take better care of it.",
      "score": 3
    },
    {
      "id": 95,
      "text": "Well, well, this is quite nice. Good length and girth. 8/10, well done.",
      "score": 8
    },
    {
      "id": 96,
      "text": "What have we here? Looks like a circus attraction. 4/10, needs some refinement.",
      "score": 4
    },
    {
      "id": 97,
      "text": "What a disaster! Looks like a deflated balloon. 2.5/10, try harder.",
      "score": 2.5
    },
    {
      "id": 98,
      "text": "What is this monstrosity? It's like a twisted piece of modern art gone wrong. 1/10, horrifying.",
      "score": 1
    },
    {
      "id": 99,
      "text": "Oh dear, looks like someone forgot to take care of this. It's like a sad wilted plant. 2.5/10.",
      "score": 2.5
    },
    {
      "id": 100,
      "text": "Whoa, this is a showstopper! Great size, shape, and presentation. 9/10, almost perfect.",
      "score": 9
    },
    {
      "id": 101,
      "text": "Can it be? I've heard legends of a 13/10... let me take a closer look... hmm... I knew it was too good to be true, this is counterfeit! MODS! BAN THIS GUY!",
      "score": -1
    },
    {
      "id": 102,
      "text": "Ohhhh my! Look at this! That's a 10/10 right there! Get your BBL Drizzy ready for this cock everyone DrakeWide ",
      "score": 10
    },
    {
      "id": 103,
      "text": "Let me take a look... a closer look... hmm... much more closer... hold on let me get my microscope... hmm... need a better zoom... ehhh, it's there... 2/10 I guess.",
      "score": 2
    },
    {
      "id": 104,
      "text": "Dear god, look at this thing! It's been suffering from an all day, all night goon session. What are you doing to this poor thing? You've rubbed it dry... 3/10",
      "score": 3
    }
  ]
}
