"
What is this nasty thing? Have you ever washed it? Disgusting... 1.5/10.~
Oh boy, I've seen this before, you got a lot of work to do kiddo... 3.5/10.~
Looks like a pretty average cock, has a lot of room for improvement. 5/10.~
Looks alright, a little on the smaller size, nice shape to it though, good angle and girth. 6.5/10!~
Look at that, impressive! Almost as big as mine, hair is trimmed well, but you could use a wash... 7/10.~
It's okay don't be shy, there we go, look at the size of this thing! That's impressive! A bit too veiny though... 7/10.~
Aren't you excited to see me? Mind if I just lift it here? You got some weight to this bad boy... 7.5/10!~
Now look at this! What an entrance that was! Ouu is this a pattern shaved in? Fancy cock there kiddo, 8/10!~
Woah- nice cock. Nice 80° angle, could trim the hairs a bit... Yep, that is a nice cock. 8.5/10!~
Now this is... this is a really nice cock. Perfect shape, very clean, hmmm... looks like you missed some hair... 9/10!~
Unbelievable! This is outstanding! Probably the best cock I have ever seen, all men should look up to you! 10/10~ 
Nice joke pal, we're rating cocks here... not snakes! Wait.. it's... oh my... 7.5/10!~
Alright let's take a look... Not bad, not bad at all, above average I'd say. 7/10!~
Let me take a look. Oh my. This is beautiful, truely a work of art. Billy would be proud of you 9/10.~
Ok take them off... oh! A tattoo? Property of... BLUESCHAMP? That guy, I tell ya... 6/10.~
Hmmm... A little shy today? That's okay, it will only cost you a few points. Let's see.... 6.5/10!~
My god, what is that thing? You could knock someone out with a swing of that bad boy. I give it... 6.5/10.~
Ok let's have a look! Are you trying into cosplay? Because this looks like Simba with all that hair. 7/10, trim it up and come back.~
Look at this puppy! Ready to take off like the Apollo 13. Pretty nice cock you got there bud, 8/10.~
Interesting... interesting... you've got style to this. Something I haven't seen in a while, but you make it work so well. Nice cock bro, 8/10!~
Woah! This is a good looking cock! It's almost- wait a second... this is fake! Get out of here you cheater!~
This... it's so shiny... why is it so shiny? How long did you spend polishing this?! 5/10...~
Let's take a look! A bit girthy today aren't we? Not bad though, I would keep it shaved, looks better, 7.5/10.~
Look at this thing! Looks like you could break a brick in half with how much meat you got on this cock, I give it... 7/10!~
Okay we got a big one here! Almost... too big... looks like you have troubles lifting that thing when you use the washroom, not ideal at all... 6/10.~
Let's see here... Looks nice, very clean, good angle and is... it is! Lemon scented too! What a gentleman! Overall, this is a quality cock, 9/10.~
Well, well... look who came crawling back for another evaluation. Drop'em. Oh nice, you've cleaned up nice. Good hair trim, adjusted your angle... 9/10, nice cock bro.~
Look at this! Good girth, pretty nice curve, and the tip-to-shaft ratio is perfect, I'd say this is almost a perfect cock, 9.5/10 well done.~
Ok lets tak- OH MY. Two? Never had that happen before... lets see... lefty gets 8/10 and righty gets 6.5/10, lil' guy needs some work.
"
