"
“Easy money!“ - Tim Every Fucking Day~
“Why the fuck did George Davis call me?“ - Tim Oct 15 2014~
“She got the D, don’t worry“ - Tim Oct 15 2014~
“This is like one of those things that like… not really scary but is like…. still scary…“ Lt. Dan Oct 22 2014~
“I don't like salt because I'm lactose intolerant“ - Lt. Dan Oct 22 2014~
“You want to come over, smoke my weed then leave?“ - Tim Oct 22 2014~
“Tinder? Dan’s favorite app!“ - Tim Oct 22 2014~
“Take the bucket of water, throw it on his penis“ - Lt. Dan Oct 22 2014~
“Know how I met timmy? I said hey what are you doing? Stop that? and he just kept licking the windows on the school bus.“ - Lt. Dan Oct 22 2014~
“If you have sexual intercorse with a stripper… do you automatically get aids? Or is it a 50/50 chance?“ - Lt. Dan Oct 22 2014~
“Why not $8.00?“ - Lt. Dan Oct 22 2014~
 “If we hit 100 I will donate 50 bucks“ - Gt500mustangs Oct 29 2014~
“If I had bigger tits, we’d have more viewers“ - Lt. Dan Oct 29 2014~
“Where’s all my black viewers?“ - Lt. Dan Oct 29 2014~
“Yeah, the titty bang. I have done it, Tim. I don't care how personal that is“ - Tim Oct 30 2014~
“I love ass, turtle ass!“ - Tim Nov 1 2014~
“I smell something burning, hopefully it's not my house“ - Tim Nov 2 2014~
“The game just came out and already it has updates, That's how many complaints there were“ - Jimmy Nov 3 2014~
“We lost Charlie, Charlie bit my finger!“ - Tim Nov 3 2014~
“The Cole train come in with his big black dick“ - Spooooky Nov 3 2014~
“Once you go black, you go death“ - Tim Nov 3 2014~
“I thought you were Kroper and was about to turn off the stream, saw you weren't so I came over“ - Spooooky Nov 3 2014~
“I suck so much dick...“ - Tim Nov 3 2014~
“I see one of them with the nigger... I mean one with the flag“ - Spooooky Nov 3 2014~
“I pull out my penis and start sucking it on stream“ - Spoooky Nov 3 2014~
“Can't say anything without it getting quoted“ - Tim Nov 3 2014~
“Tim I can't facetime you but I can snapchat you my fucking balls!“ - Spoooky Nov 3 2014~
“He just busted it out, oh god, he busted it out“ - Tim Nov 4 2014~
“You would jerk Dan off you faggot!“ - Tim Nov 4 2014~
“This guy can't be anymore of a fucking tool“ - Tim Nov 5 2014~
“That's right, you heard it right, I'm gonna rape you!“ - Tim Nov 5 2014~
“Beby booby boop boop boop. Boobity beep“ - Tim Nov 9 2014~
“Good! Don't fucking die, homo dick“ - Tim Nov 9 2014~
“Faggot get rabbit punched. Get donkey kicked“ Tim Nov 9 2014~
“I wont eat a dick, but I'd eat a weiner. Amirite? Kappa“ Vindi Nov 9 2014~
“I need more weed in me, one of those breaks are coming up soon“ - Tim Nov 10 2014~
“Dude you just... say something“ - Tim's Dating Advice Nov 11 2014~
“Damn right I'm gonna smoke a big mac!“ - Tim Nov 11 2014~
“Dickshots on stream“ - Tim Nov 11 2014~
“So basically I play without pants when I stream“ - Tim Nov 11 2014~
“I'm depressed, I'm gonna cut myself on stream, ahhhhh!“ - Tim Nov 11 2014~
“Life is titty bang!“ - Tim Nov 11 2014~
“I've become so gay“ - Tim Nov 11 2014~
“I'm Aquaman!“ - Tim Nov 14 2014~
“I'm gonna beat every fucking game I play“ - Tim Nov 14 2014~
“In honor of Soda, every needler I pass, I will pickup.“ - Tim Nov 14 2014~
“I don't even know obama's lost son“ - Tim Nov 14 2014~
“If you're black in here, don't get offended.“ - Tim Nov 15 2014  At 4:20 Kappa~
“I get so hyped when I hear stone cold et, screaming oh hell yeah! In my astro's 7.1 surround sound, It gets me pumped like DMX, it makes me want to run up my stairs and see like, my mom, or brother and punch the shit out of them.“ - Tim Nov 15 2014~
“How do you be cool?“ - Tim Nov 15 2014~
“I smoke crystal meth“ - Tim Nov 15 2014~
“She's a whore.“ - Tim Nov 18 2014~
“Tell me about my wiener“ - Tim Nov 18 2014~
“You can wank me anytime pie“ - Jimmy Nov 18 2014 ~
“He likes to fap to houses“ - Tim Nov 19 2014~
“It's a party in my pant's and you're all invited!“ - Tim Nov 19 2014~
“Kyle, Jimmy, Timmy, We're all southpark characters.... WE'RE THE RETARDED ONES!“ - Tim Nov 19 2014~
“Fuck the Marshals, THEY HATE EMINEM!“ - Jimmy Nov 19 2014~
“So nightbot's not a person?“ - Lt. Dan Nov 20 2014~
 “Piemeup keeps quoting me...“ Lt. Dan - Nov. 20 2014~
“He has someone who draws all of his stuff, I'll have to draw it myself.“ - Lt. Dan Nov 20 2014~
“Your laptop has aids, same virus Jimmy has“ - Tim Nov 20 2014~
“Top of the rim, rim job!“ - Lt. Dan Nov 20 2014~
“When I start streaming, I'm gonna start a donation drive... for my C's... my big ass titties. Then when someone donates it's gonna say, OH BIG TITS!“ - Lt.Dan Nov 20 2014~
“Suck a fat sac of dicks“ Tim November 20 2014~
“It's actually not considered rape if you yell surprise, and you kill them after. It works for me.“ - Lt. Dan Nov 20 2014~
“First person bong hits“ - Tim Nov 20 2014~
“Will and Dan are bad, they're BK, a bunch of Burger Kings“ - Tim Nov 21 2014~
“ if i gimme ur home address ill mail u a dragon dildo“ - Vindi Nov 26 2014~
“I remember my first rape. I mean beer“ - Jimmy Nov 26 2014~
“I'm a giant beautiful monkey!“ - Tim Nov 27 2014~
“Lamb of God, the entire band is on the other team, we're fucked“ - Tim Nov 28 2014~
“Kroper, don't suck dicks for a living...“ Tim Nov 28 2014~
“Hybrid crab zombies“ - Tim Nov 30 2014~
“I know how you kids like them sloppy! I know how you kids like them dicks!“ - Tim Nov 30 2014~
“My first and last name, I legally switched to Glyde and TV“ - Tim Nov 30 2014~
“Half life 3 confirmed“ - Tim Dec 3 2014~
“ illuminati has 10 words, its associated with tim (10-3 = 6), hes playing part 3, (6-3 = 3), december 3, 2014 = (4-1 = 3), all 3's; Half life 3 confirmed.“ - Vindicationn Dec 3 2014~
“The last of us is a game I will definitely beat.“ - Tim Dec 3 2014~
“Oh man, I'm going full blown man bear pig“ - Tim Dec 6 2014~
“I'm gonna fuck snow white“ - Tim Dec 6 2014~
“I bet snow white is wet at the moment“- Tim Dec 6 2014~
“I need a sweet loving Bigby“ - Tim Dec 6 2014~
“I hate turtles, I like aids“ - Tim Dec 8 2014~
“Gurdy, you fat sack of shit“ - Tim Dec 11 2014~
“2 headed Alaskan bull worms are a rare species, down here in Isaac's basement.“ - Tim Dec 11 2014~
“We're gonna turn this bitch around and go right in“ - Tim Nov 28 2014~
“If I ever kill a turtle in this game by accident, I will never play it again!“ - Tim Dec 28 2014~
“Condom? That guy has a condom! He was gonna rape me!“ - Tim Dec 28 2014~
“I just got raped“ - Tim Dec 28 2014~
“You broke your bong, I'm so sad. That's like a mans best friend...“ - Tim Dec 28 2014~
“I'm gonna call you M99 oh fuck me“ - Tim Jan 7 2015~
“99% of the raps turn into I like turtles, then you rhyme turtles with squirtles and make pokemon references...“ - Tim Jan 7 2015~
“I have a penis cam, that would rule, I'll watch your stream every day“ - Tim Jan 7 2015~
“I have a feeling if I stand up, twitch will ban me“ - Tim Jan 7 2015~
“I never wore pants, ive never worn pants a day in my life“ - Tim Jan 7 2015~
“I was at olive garden no boxers, butt naked and no one cared“ - Tim Jan 7 2015~
“I'm getting raped, like brutally hard“ - Tim Jan 7 2015~
“The day i get twitch partnership, pm me your address and i'll buy you a pizza“ - Tim Jan 11 2015~
“Rapeing grown ass men“ - Tim Jan 12 2015~
“I put the awp in awesome“ - Tim Jan 12 2015~
“I'm super stoned right now.... and tired...“ - Tim Jan 13 2015~
'Kim Kardashian's ass is on my team, that's pretty cool.“ - Tim Jan 15 2015~
“My mind is hurting and my... fucking aids is hurting even more.“ - Tim Jan 15 2015~
“I was in a boy band once, We were called the turtles. The little turtles.“ - Tim Jan 15 2015~
“I'm gonna have her cook 100 hot dogs, and if you follow the stream I will mail you a hot dog and you have to eat it“ - Tim Jan 16 2015~
“OHHHHH HO HO HOOOO! Almost just got ran over by a deer“ - Tim Jan 17 2015~
“Nova blows dogs for quarters“ - Tim Jan 19 2015~
“Looks like @Bigdilbo want's to come and play“ - Tim Jan 19 2015~
“I haven’t read a book since 6th grade“ - Tim Jan 19 2015~
“i was sucking dicks earlier“ - Tim Jan 19 2015~
“rape me again“ - Tim January 19 2015~
“Your boyfriends pissing you off? That's not good, slap him upside the head, show him who's boss“ - Tim's Relationship Advice Jan 19 2015~
“The cure is turtle cum. That's why the turtle is my spirit animal, it cured my aids.“ - Tim Jan 19 2015~
“What a horrible position to be in“ - Tim Jan 19 2015~
“I just sniped Queen Elizabeth pussy, never thought that sentence would come out of my mouth“ - Tim Jan 19 2015~
“If I get another binding of isaac skin I will kill myself“ - Tim Jan 19 2015~
“I like turtles even if they are black..“ - Tim Jan 19 2015~
“Who the fuck is Mr Meow?“ - Tim Jan 21 2015~
“my ex bf's username was glyde so my name is glyde, I just miss him a ton“ - Tim January 21, 2015~
“And my mod apparently turned into a duck....“ - Tim Jan 21 2015~
“We need an I'm done remote!“ - Tim Jan 21 2015~
“Cheiden being mod was the dumbest thing that has ever happened in this stream“ - Tim Jan 21 2015~
“Suck a fat sack of sacks“ - Tim Jan 22 2015~
“Get ogred“ - Tim Jan 23 2015~
“Oh sweet tooth, you got a sweet dick“ - Tim Jan 25 2015~
“I'm gonna start cutting myself on stream tonight, all because of you guys“ - Tim Jan 25 2015~
“Did you guys know I was nicknamed, Mark Big Mac McGuire in high school?“ - Tim Jan 25 2015~
“I don't even want to hear another OH HELL YEAH tonight“ - Tim Jan 26 2015~
“Is this Forza 6? No this is Forza 7 scrub.“ - Tim Jan 28 2015~
“Apple turnover? Swag me out!“ - Tim Jan 30 2015~
“Pimp my ride, I was a big fan of that when I was in grade 6, just because of xibit.“ - Tim Jab 30 2015~
“If Tay Zonday comes into my stream, he's going to get INSTA MOD!“ - Tim Jan 30 2015~
“I practice sucking dick at the glory holes“ - Vindi Feb 1 2015~
“Doc's dead, Dr. Dre“ - Tim Feb 2 2015~
“Don't tell me what to drop, Drop your pants Rais“ - Tim Feb 2 2015~
“Reverse sexy moron“ - Tim Feb 2 2015~
 “I love five guys“ - Tim February 03, 2015~
“You're a real Mc-asshole, take my fukking car dude“ - Tim Feb 7 2015~
“Lead the way you big, blue eyed bimbo!“ - Tim Feb 9 2015~
“27 Inches, Nice man!“ - Tim Feb 9 2015~
“This is like the golden era of hip-hop, before the golden era of hip-hop“ - Tim Feb 13 2015~
“As soon as I was getting humped...“ - Tim Feb 15 2015~
“Hambo like Rambo“ - Tim Feb 16 2015~
“Can we make toxic ass a thing“ - Elisa Feb 16 2015 ~
“I would take you on a date man“ Timmy Feb 16, 2015~
“Bennetts are not meant to be broken“ - Tim Feb 16 2015~
“I GOT IT!!!!!!! Tim licked the windows at a nuclear power plant thus resulting in massive cranial swelling so now we have the fat Christmas ham we see before us“ - Turbo Feb 16 2015~
“It's not turbo time, Arnold Schwarzenegger has never been so wrong in his life“ - Tim Feb 16 2015~
“I'm gonna quit casting forever, I can't take it anymore“ - Tim Feb 16 2015~
“weird last name cuz hes a fucking swedish“ - Tim Feburary 17, 2015~
“If you put me on a drum set, I think I can just go ham“ - Tim Feb 21 2015~
“I welcome that punch in the face I deserve it“ - Tim Feb 21 2015~
“Jimmy lies about you all the time. He said to me the other day, hey Timmy, you know who's a faggot? That piemeup guy“ - Tim Feb 21 2015~
“Sweat-low. That's my home town“ - Tim Feb 22 2015~
“I am a proud, proud, fast food consumer. Fast food is the best food in the world!“ - Tim Feb 22 2015~
“You killed Timmy and gave him a breakaway!“ - Jimmy Feb 23 2015~
“Dude! That kid's dead! We just killed him! His mom came in and executed him! His mom just shot him!“ - Spooooky Feb 23 2015~
“It's Chris Hanson! Here on dateline nbc, he cut his wiener in half because you wouldn't do anal with him...“ - Spooooooky Feb 23 2015~
“goldberg in his prime, i would let spit on me“ - Timmy Feb. 26, 2015~
“Supaflip's 10$ donation broke the game“ - Tim Feb 28 2015~
“You got the aim of a motha fuckin' potato! You know that?“ - Tim Feb 28 2015~
“Motorboat dem booty cheeks“ - Tim Mar 1 2015~
“No ya half a meat ball! Get in the driver seat!“ - Tim Mar 2 2015~
“He's an Olympic athlete, he is 6'8 and runs faster then Usain Bolt!“ - Tim Mar 4 2015~
“This guy is just.... going to town right now... I gotta leave...“ - Tim Mar 4 2015~
“You want me to have your baby? Get away from you, you crazy mother fucker!“ - Tim Mar 4 2015~
“Leg is worth your penis. Wow, quote of the night. That is the most truthful thing I have heard tonight“ - Tim Mar 4 2015~
“Everybody out, right meow!“ - Tim Mar 6 2015~
“#ripduck 3/6/15 10:20“ - Mattsmith112 Mar 6 2015~
“Explosive turtle, the salty turtle, king turtle, antimicrobial turtle, and antique turtle!“ - Tim Mar 9 2015~
“Arcane Nullifier X-21, oh my God, I'm gonna name my next pet that, it will show it on it's collar and everything.“ - Tim Mar 9 2015~
“WOLOLOLOLOLOLOLOLO“ - Tim Mar 11 2015~
“Mgggnaaaa. Cause you know, that's the noise turtles make. Mgnaaa!“ - Tim Mar 11 2015~
“I want Timmy's D. Done...“ - Tim Mar 11 2015~
“Guys I kissed a dick and I liked it“ - Spoooooky Mar 13 2015~
“The true question is, can I quote myself on stream? - Pie Mar 13 2015~
“I'm beyond done, I can't even handle this tonight“ - Tim Mar 13 2015~
“I got Dr. EZ$ we aren't losing!“ - Tim Mar 14 2015~
“Motherless humphead“ - Tim Mar 14 2015~
“This city sucks, oh fuck you earl maison, or travis..“ - Tim Mar 15 2015~
“Everyone give Clint Eastwood's Zucchini an oh hell yeah“ - Tim Mar 15 2015~
“Oh my god yes we got a street bike, I'm not street bike Tommy! I'm the entire nitro circus crew!“ - Tim Mar 17 2015~
“Smile if you masturbate“ - Tim Mar 21 2015~
“Dude those hard candies were the tits man!“ - Tim Mar 23 2015~
“Bye guys, I'm done, I'm quitting streaming forever“ - Tim Mar 27 2015~
“I'm so done with onefew, I give full permission for any mod to ban him... forever! Cause he is gonna give me a heart attack“ - Tim Mar 27 2015~
“How do I make 200$ an hour? I'm just a big headed idiot who loves streaming“ - Tim Mar 28 2015~
“I am no longer a bathroom serial killer“ - Tim Mar 30 2015~
“Look at the ban hammer Stephen just dropped! It looks like a dick! It's the ban dick!“ - Jimmy Apr 2 2015~
“Who's a little over 4 inches? I don't know, maybe Jimmy?“ - Spooooky Apr 2 2015~
“Morgan Freeman's long lost brother, Freddy Freeman is up to bat“ - Tim Apr 8 2015~
“how much money do you think it would take to buy yourself a sub button?  i wanna start streaming but wanna just cut right to the chase“ - Gaulzilla Apr 10 2015~
“Don’t apply your aids!“ - Tim Apr 10 2015~
“I wanna drown Tim in semen“ - Turbotragedy 4/12/2015~
“When my beard is long I feel like a caveman, or a neanderthal“ - Tim May 17 2015~
“What's Glyde's thoughts on prostate exams?“ - Tim May 17 2015~
“Who the fuck is your boyfriend??? Am I about to get jumped?“ - Tim May 17 2015~
“sometimes i roleplay as a ham sandwich and cover myself in mayonnaise and cheese“ - Spoooooky May 17 2015~
“We're at this battlefield.... hardline... this game sucks“ - Tim May 18 2015~
“I spray painted my computer black today. I was hoping it would be faster, but now it just doesn't work.“ - Spooooky May 20 2015~
“I go like sonic the hedgehog fast“ - Spoooooky May 20 2015~
“Do you ever just wanna grow up and become a water heater?“ Spoooooky May 20 2015~
“I'm gonna drop steaming to become a model, a thumbs up model!“ - Tim May 22 2015~
“We are going all in #ALLIN“ - May 25 2015~
“13 year old grown ass man.“ - Tim May 30 2015~
“Pervet“ - Tim May 30 2015~
“I can't believe that was the way of them making the game appropriate... giving us piss bullets“ - Tim May 31 2015~
“He's rapping over MF Doom's boot“ - Tim June 1 2015~
“Suck a fat sack of.... sacks“ - Tim Jun 1 2015~
“StreakyPluto... how did you come up with that name? And the first 609 of them were taken?“ - Tim Jun 2 2015~
“Oh you half a meatball, sandwich.... dick“ - Tim Jun 2 2015~
“You gotta transform into a pogo stick and just start hoppin“ - Tim Jun 4 2015~
“If I ever shrug off a 40$ donation you guys have my permission to come into my house and beat the shit out of me“ - Tim Jun 4 2015~
“Dude fallout 4 I can't wait. That dog in the trailer was so hype. I'm buying it just for the dog.“ - Tim Jun 4 2015~
“Who the fuck is Jeremy? The donation is single digit? That's not JFlan is it? - Tim Jun 5 2015~
“Eyy what’s up bitch nigga?“ - Tommy Jun 5 2015~
“Females doing squats, I for one am not saying shit, I don't mind it“ - Tim Jun 5 2015~
“I just got shot in the butt again! I am just... butt hurt“ - Spoooooky Jun 5 2015~
“If I were you, I would meet them and kiss them... on the mouth.“ - Spoooooky Jun 5 2015~
“These bitches are on the Oregen trail, back when aunt Mary is dieing from aids... or gonorrhea, something like that, they're coming and robbing her while I'm trying to make it down the stream, and JFlan has the elephant gun“ - Spooooooky Jun 5 2015~
“Gonna bang some demon bitches in the witcher“ - Spoooooky Jun 5 2015~
“You half a meat ball with no sauce, no bread, no butter, nothin“ - Tim Jun 5 2015~
“6 different attachments on a gun? What are you gonna start putting on it? A blender, microwave, toaster...“ -- Tim Jun 6 2015~
“...Or you can call me Glyde... or you can call me dickhead3000“ - Tim Jun 7 2015~
“I've always wanted to get the James Bond movies on BloxRay“ - Tim Jun 7 2015~
“I will do a 24 hour stream, if we get $2400 in one week“ - Tim Jun 7 2015~
“I want to rifle butt myself in real life in the head. Good thing I don't have a gun or else you guys would be in for a surprise.“ Tim Jun 8 2015~
“Yeah, her ass is unreal! You gotta give credit where credit is due“ - Tim Jun 8 2015~
“inverting a penis is more commonly known as getting ‘Bruced’ “ - Spooooky Jun 8 2015~
“Do you feed? What the fuck does that mean? I feed my dogs.... my yorki is really fat because I give him a lot of treats“ - Tim Jun 10 2015~
“I'm no professional P-Semen“ - Tim June 11 2015~
“They should just release the last of us, but the entire game you use water guns.“ - Tim Jun 21 2015~
“Hearthstone would be a lot more fun if Edward Norton and Brad Pitt were in it“ - Tim Jun 22 2015~
“Dan are you talking about underage women on my stream? ....Stop hanging out at the elementary school then ya perv!“ - Tim Jun 24 2015~
“Fallout copied Morrowwind“ - Lt. Dan Jun 24 2015~
“She blamed Tommy immediately, as if he unscrewed the bolt from her chair“ - Tim Jun 24 2015~
“There were 2 hot girls we were surfing with and I was full game to go mackin' with one and this guy... he wasn't with it.“ - Tim Jun 2015~
“I have hepatitis A and B. I am working on C.“ - Lt. Dan Jun 24 2015~
“This kids streaming, I'm gonna fight him!“ - Tim Jun 29 2015~
“Only if we had emotes, and we had a scumbag Dan emote, and I look over and the entire chat is filled with it“ - Tim Jun 29 2015~
“We need some cola pop, you know matey?“ - Tim Jun 29 2015~
“Going hambo like rambo, we're having a lan...bo“ - Tim Jun 29 2015~
“Dan's Illuminati, #DanIlluminati“ - Tim Jun 29 2015~
“OH WOW.... what are you...? A mod?“ - Lt. Dan Jun 29 2015~
“They call me shooty-gun-jotty... or at least they use too“ - Lt. Dan Jun 29 2015~
“Mayonnaise... fuckin' filled.... donation“ - Tim Jul 7 2015~
“Supaflip I was makin' Timmy scream last night, I walked in kissed him. Then it was a pants off dance off, I gave him the thriller“ - Spoooooky Jul 7 2015~
“Sammi smells like eggs“ - Spooky Jul 7 2015~
“Humpty dumpty was my dude back in the day, he would just spread his ass and I would love it, but you Sammi, you smell like eggs and I love it“ - Spoooooky Jul 7 2015~
“Kim, after the stream, me and Timmy will lay in bed together and watch Child's Play“ - Spooooky Jul 7 2015~
“You make a ham sandwich 3 weeks later and be like, Oh look there's sand in it!“ - Spooooky Jul 7 2015~
“I love floppy dick“ - Spooooky Jul 7 2015~
“Sammi, I've taken shits I would play with more then The Evil Within“ - Spooooky Jul 7 2015~
“Sammi I know before you post, because I just smell eggs. The smell of eggs just fills my nostrils“ - Spoooooky Jul 7 2015~
“Uptime is 45 hours for the day“ - Tim Jul 10 2015~
“If I die, I'm gonna throw my xbox out the window... I don't know why I would throw my xbox since I am on PC“ - Tim Jul 11 2015~
“It's not letting me rip my pants off“ - Tim Jul 11 2015~
“Oh no it's raining, better get naked as fast as I can“ - Tim Jul 13 2015~
“I'm the headless horseman look! NO ONE WILL KNOW WHAT SPOOOOKY'S FACE WILL LOOK LIKE“ - Spoooooky Jul 13 2015~
“I'm gonna eat another type of cake later Pie, Timmy's butt!“ - Spoooooky Jyl 13 2015~
“If you add the 2, 3.33 it makes 666. Half life 3 confirmed“ - Spooooooky Jul 13 2015~
“I have a 6 inch demon wrapped up for you later“ - Spoooooky Jul 13 2015~
“I start sucking your dick....“ - Spoooooky Jul 13 2015~
“Bennett what line? The line of coke I did off Timmy's ass before the stream?“ - Spooooooky Jul 13 2015~
“April fools bitch, In June! .... July“ - Spooooooky Jul 13 2015~
“That guy's got potato aim“ - Tim Jul 13 2015~
“He's got big sock'em boppers!“ - Tim Jul 15 2015~
“The scariest part of resident evil 4 is teaming up with Ashley“ - Tim Jul 15 2015~
“The turtle chainsaw massacre, its 3 turtles in Texas, 18 hours later they make it like 3 hours down the road. There's a turtle with a leather face mask on, and the chase scene is him holding a chainsaw taking one step at a time and it's really slow“ - Spooooooky Jul 15 2015~
“Dan is so dumb, Dan is the dumbest“ - Donny Jul 23 2015~
“He was sitting there making his gamertag and was like, what is my favorite food? Mashed Potatos... what's my name? Dan. MashedPotatoDan“ - Tim Jul 23 2015~
“Donny's the king of holding balls, I'm the king of doming domes“ - Tim Jul 23 2015~
“GlueTV, I don't do anything, just eat glue the entire stream. I fucking love elmer's glue“ - Tim Jul 26 2015~
“Don't mind me I am a twinkie on wheels“ - Tim Aug 7 2015~
“Been live for almost 3 days...“ - Tim Aug 8 2015~
“Nice head“ - Donny Aug 11 2015~
“Ask me about my wiener“ - Tim Aug 12 2015~
“I'm gonna hijack this pitchfork! .... I mean, forklift“ - Tim Aug 15 2015~
“I have no problem turning this game into the Legolas simulator. Fellowship of The Turtle!“ - Tim Aug 15 2015~
“How did your gay do?“ - Tim Aug 15 2015~
“CALL OF DUTY BLACK OPS 2 BETA!!! .... I mean Black Ops 3“ - Tim Aug 17 2015~
“Same blood we both got aids brother“ - Tim Aug 19 2015~
“Enemy has aids“ - Tim Aug 20 2015~
“I can't just eat a salad, I would rather just go out back and eat some grass“ - Tim Aug 20 2015~
“How does this kid, and his microwave headset... the quality is horribly, why does he keep talking?!“ - Tim Aug 20 2015~
“I hate when people block your running path, they are just the fattest mother fuckers around“ - Tim Aug 26 2015~
“I think they're at an advantage having Biggie Smalls on their roster“ - Tim Aug 26 2015~
“The kids name is MuffinGears, he loves Muffins and Gears“ - Tim Aug 26 2015~
“I have STD's... I have STD's...“ - Tim Aug 26 2015~
“Am I drunk? I think I might be drunk“ - Tim Aug 26 2015~
“Nickleback my favorite band“ - Tim Aug 29 2015~
“I'm an ass man“ - Tim Sept 5 2015~
“You should see the gif of this ass Fury just posted, I can't concentrate I am distracted“ - Tim Sept 5 2015~
“Supaflip was a mod for like... 10 min, and his modding abilities were fucking remarkable“ - Tim Sept 5 2015~
“I haven't said anything stupid in almost a month, that's not okay...“ - Tim Sept 22 2015~
“I'm gonna start headbutting my monitor from all this hype“ - Tim Sept 22 2015~
“Cum on meee hypeee!“ - Tim Sept 22 2015~
“The guy who coded the gaps was in my stream today. He confirmed there was a whole lot of gaps“ - Tim Sept 29 2015~
“Why are you slamming like that Shaquille O'Neal“ - Tim Sept 29 2015~
“I will never stream again because of Tony Hawk and his shitty lunch box collecting mission. This doesn't even have any relevance, we're not even at school 3, why is there lunch boxes?“ - Tim Sept 29 2015~
“We got Scuba Steve and a god damn alien as a playable character“ - Tim Sept 29 2015~
“Shut the fuck up, Wiz Khalifa screamin' in here“ - Tim Oct 3 2015~
“I created this account October 3, 2015. It's been a long time.“ - Tim Oct 3 2015~
“Can you please take your head out of the microwave before you use your headset“ - Tim Oct 3 2015~
“I'm literally in between two dudes right now“ - Tim Oct 3 2015~
“I stream outside, I don't have a house“ - Tim Oct 3 2015~
“We are sticking our whole hand in there! Before it was just the index finger!“ - Tim Oct 3 2015~
“What's up with this music? What was that? I feel like we just got back from a commercial break from Who Wants To Be A Millionaire“ - Tim Oct 6 2015~
“Everyone says I look like CM-Punk. More like CM Punk ass little bitch“ - Oct 6 2015~
“Chris Hanson here, Dateline NBC. Are you aware this girl is 14? Are you aware you told her that you would come over to eat cookies and milk, then make love to her?“ - Tim Oct 6 2015~
“There's another quote right there, I hate Stephen“ - Jimmy Oct 6 2015~
“I just turned into Axel from Sweet Tooth!“ - Tim Oct 7 2015~
“Kurt Dangle, the milk man... the Olympian“ - Tim Oct 14 2015~
“Leon loves the booty, I don't blame him ‎( ͡° ͜ʖ ͡°) “ - Tim Oct 14 2015~
“Ashley is a half a meat ball, not even, she's a half a half a meat ball. A quarter of a meat ball“ - Tim Oct 14 2015~
“GlodTB“ - Pie Oct 17 2015~
“I can't wait for Halo 3“ - Tim Oct 23 2015~
“Is she ridin' us right now? And killing us?“ - Tim Nov 7 2015~
“I'm gonna go jump off rock bottom, Dwayne The Rock Johnson“ - Tim Nov 8 2015~
“I'm trying to get sponsored by Brazzers. WHY DOESN'T BRAZZERS SPONSOR ME!?! Oh wait, cause I got a huge head..... on my shoulders“ - Tim Nov 8 2015~
“I would cry like a little fucking girl on stream“ - Tim Nov 21 2015~
“Make you all tingly? I can see that ( ͡° ͜ʖ ͡°) “ - Tim Nov 21 2015~
“Hi Jem, nice to meet you. Never talked to you before even though you mod the stream“ - Tim Nov 24 2015~
“I'm a dinner table, muthafucker!!!“ - Tim Dec 1 2015~
“I'm pretty loyal to Brazzers, they're kind to me...“ - Tim Dec 12 2015~
“Less and less clothing is what I recommend“ - Tim's Dating Advice Dec 12 2015~
“Holy spam, Batman!“ - Tim Dec 19 2015~
“Get out of my way you... fedora wearing maniac!“ - Tim Dec 25 2015~
“School is your last priority no matter what“ - Tim Jan 1 2016~
“Homie is quoting in 2015 still. You gotta step your quote game up“ - Tim Jan 1 201X Kappa~
“I want Taco Bell 110% right now!“ - Tim Jan 1 2016~
“every time you go full screen I squee, wanna run my hotdogs through your luscious locks sooooo bad“ - Claire Jan 1 2016~
“Johnny Football what are you doing?“ - Tim Jan 2 2016~
“I normally don't stream with pants on at all, I'm usually naked“ - Tim Jan 2 2016~
“Look at that Ben Stiller aim“ - Tim Jan 2 2015~
“I'll do it today, after today“ - Tim Jan 4 2016~
“I'm about to throw my PS4 so far out my window that it lands in my neighbors living room. What the fuck is my team doing? They better be all blind... armless.“ - Tim Jan 18 2015~
"
